Tekla Open API Reference for Tekla Structures 2025
MarkBase.IsAssociativeNote Property
 Gets a value indicating whether the mark is an associative note.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsAssociativeNote { get; }
Public ReadOnly Property IsAssociativeNote As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MarkBase Class
Tekla.Structures.Drawing Namespace